import streamlit as st

from register_functions import pani_namune, mith_namune, AFP_register, gappi_mase_paidas_register, das_utpatti_thikane, \
    shala_pat, anganvadi_pat, OT_register, motibindu_register, sanshiyat_motibindu_reg, kushthrugn_register, \
    sanshyit_kusthrugn_register, TCL_namuna, snshayit_kshay_rugna_register, upacharakhalil_shyrugn


def mpw_registers():
    st.markdown("## 🗂️ MPW Registers")

    menu_items = [
        "पाणी नमुने तपासणी रजिस्टर",
        "ओ.टी. तपासणी रजिस्टर",
        "टी.सी. एल. तपासणी रजिस्टर",
        "संशयित क्षयरोग (TB) रुग्ण नोंदवही",
        "उपचाराखालील क्षयरोग (TB) रुग्ण नोंदवही",
        "संशयित कुष्ठ रुग्ण नोंदवही",
        "उपचाराखालील कुष्ठ रुग्ण नोंदवही",
        "संशयित मोतिबिंदू नोंदवही",
        "मोतिबिंदू शस्त्रक्रिया नोंदवही",
        "डास उत्पत्ती ठिकाणांची माहीती",
        "गप्पी मासे पैदास केंद्रांची माहीती",
        "मीठ नमुने तपासणी नोंदवही",
        "AFP 21 नोंदवही",
        "अंगणवाडी मुलामुलींची पटसंख्या",
        "शाळेतील मुलामुलींची पटसंख्या",
    ]

    # ---- SIDEBAR MENU ----
    st.sidebar.title("📋 रजिस्टर मेनू")
    selected = st.sidebar.radio("रजिस्टर निवडा :", menu_items)

    st.divider()
    st.subheader(f"📘 {selected}")

    # ---- PAGE CONTENT ----
    if selected == "पाणी नमुने तपासणी रजिस्टर":
        pani_namune()

    elif selected == "ओ.टी. तपासणी रजिस्टर":
        OT_register()

    elif selected == "टी.सी. एल. तपासणी रजिस्टर":
        TCL_namuna()

    elif selected == "संशयित क्षयरोग (TB) रुग्ण नोंदवही":
        snshayit_kshay_rugna_register()

    elif selected == "उपचाराखालील क्षयरोग (TB) रुग्ण नोंदवही":
        upacharakhalil_shyrugn()

    elif selected == "संशयित कुष्ठ रुग्ण नोंदवही":
        sanshyit_kusthrugn_register()

    elif selected == "उपचाराखालील कुष्ठ रुग्ण नोंदवही":
        kushthrugn_register()

    elif selected == "संशयित मोतिबिंदू नोंदवही":
        sanshiyat_motibindu_reg()

    elif selected == "मोतिबिंदू शस्त्रक्रिया नोंदवही":
        motibindu_register()

    elif selected == "डास उत्पत्ती ठिकाणांची माहीती":
        das_utpatti_thikane()

    elif selected == "गप्पी मासे पैदास केंद्रांची माहीती":
        gappi_mase_paidas_register()

    elif selected == "मीठ नमुने तपासणी नोंदवही":
        mith_namune()

    elif selected == "AFP 21 नोंदवही":
        AFP_register()

    elif selected == "अंगणवाडी मुलामुलींची पटसंख्या":
        anganvadi_pat()

    elif selected == "शाळेतील मुलामुलींची पटसंख्या":
        shala_pat()
